### 데이터베이스
- 작은단위의 db는 csv사용, 큰 단위는 db 사용
- 거의 모든 데이터는 db로 사용하므로 필수로 사용해야 한다.

##### SQLite
: 가볍게 파일 하나로 사용할 수 잇는 데이터 베이스
: DBMS가 아니므로 데이터 관리용은 아니다.(단순 저장용)
: 오리지널은 MS office 엑세스

In [2]:
import sqlite3

In [3]:
# sqlite 데이터베이스 연결하기
dbPath = "../Data/test.sqlite"
conn = sqlite3.connect(dbPath)    #connection

# 테이블을 생성하고 데이터 넣기
curs = conn.cursor()

# 여러 커맨드 한꺼번에 실행할 때 vs, curs.execute() - 한 커맨드씩 실행할 때
curs.executescript(
    """
    /* items 테이블이 이미 있다면 제거하기 */
    DROP TABLE IF EXISTS items;
    
    /* 테이블 생성하기 */
    CREATE TABLE items(
        item_id INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT UNIQUE,
        price INTEGER
    );
    
    /* 데이터 넣기 */
    INSERT INTO items(name, price) VALUES ('Apple', 800);
    INSERT INTO items(name, price) VALUES ('ORANGE', 780);
    INSERT INTO items(name, price) VALUES ('Banana', 430);
    
    """
)

# 위의 작업을 DB에 반영하기
conn.commit()

In [4]:
# 데이터 추출하기
curs = conn.cursor()
curs.execute("SELECT * FROM items")
item_list = curs.fetchall()
print(item_list)    #tuple 형식으로 들어가 있다.

[(1, 'Apple', 800), (2, 'ORANGE', 780), (3, 'Banana', 430)]

In [5]:
item_list[0]

(1, 'Apple', 800)

In [9]:
for item in item_list:
    print(item[0], item[1], item[2])

1 Apple 800
2 ORANGE 780
3 Banana 430

In [12]:
import sqlite3

filePath = "../Data/test2.sqlite"
conn = sqlite3.connect(filePath)

# 테이블 생성하기
curs = conn.cursor()
curs.execute("DROP TABLE IF EXISTS items")
curs.execute(
    """
        CREATE TABLE items(
        item_id INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT UNIQUE,
        price INTEGER
    );

    """
)

conn.commit()

In [13]:
# 데이터 넣기
curs = conn.cursor()
curs.execute("INSERT INTO items (name, price) VALUES (?,?)", ("Orange", 5200))  #TUPLE 형식으로 insert
conn.commit()

In [14]:
# 데이터 추출하기
curs = conn.cursor()
curs.execute("SELECT * FROM items")
item_list = curs.fetchall()
print(item_list)    #tuple 형식으로 들어가 있다.

[(1, 'Orange', 5200)]

In [15]:
# 여러 데이터를 연속으로 넣기
curs = conn.cursor()
#list 안에 Tuple
data = [("Mango", 7700), ("Kiwi", 4000), ("Peach", 9400), ("Persimmon", 7000), ("Banana", 4000)]
# executemany: 배열로 가져와서 insert
curs.executemany("INSERT INTO items(name, price) VALUES (?,?)", data)
conn.commit()

In [16]:
# 데이터 추출하기
curs = conn.cursor()
curs.execute("SELECT * FROM items")
item_list = curs.fetchall()
print(item_list)    #tuple 형식으로 들어가 있다.

[(1, 'Orange', 5200), (2, 'Mango', 7700), (3, 'Kiwi', 4000), (4, 'Peach', 9400), (5, 'Persimmon', 7000), (6, 'Banana', 4000)]

In [27]:
# 4000~7000원 사이의 데이터 추출하기
curs = conn.cursor()
curs.execute("SELECT * FROM items where price between ? and ? ", (4000, 7000))
item_list = curs.fetchall()
print(item_list)    #tuple 형식으로 들어가 있다.

[(1, 'Orange', 5200), (3, 'Kiwi', 4000), (5, 'Persimmon', 7000), (6, 'Banana', 4000)]

------
## MYSQL

In [1]:
# !pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 43.8/43.8 kB 3.5 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [2]:
import pymysql

In [3]:
# Connection
conn = pymysql.connect(host="127.0.0.1",
                       user = "root",
                       password = "qwer1234",
                       db = "education",
                       charset = "utf8"
                       )

In [4]:
# Cursor
curs = conn.cursor()

In [5]:
sql = "select * from student"
curs.execute(sql)

5

In [6]:
rows = curs.fetchall()
print(rows) #tuple 안에 tuple 있음 > list로 변환

(('S003', '이승호', '국문학과', '345-6789', None), ('S004', '최민국', '컴퓨터공학과', '234-5678', None), ('S005', '이승호', '국문학과', '345-6789', None), ('S006', '정수봉', '국문학과', '456-7890', None), ('S007', '황정숙', '사학과', None, None))

In [7]:
# list로 변환
rowList = list(rows)
rowList

[('S003', '이승호', '국문학과', '345-6789', None),
 ('S004', '최민국', '컴퓨터공학과', '234-5678', None),
 ('S005', '이승호', '국문학과', '345-6789', None),
 ('S006', '정수봉', '국문학과', '456-7890', None),
 ('S007', '황정숙', '사학과', None, None)]

In [10]:
print(rowList[0][1])

이승호

In [11]:
sql = "insert into student(scode, sname, sdept, sphone, saddress) values (%s, %s, %s, %s, %s)"

In [12]:
curs.execute(sql, ('b001', '유비', '국문학과', '010-1111', '서울'))
curs.execute(sql, ('b002', '관우', '심리학과', '010-2222', '서울'))
curs.execute(sql, ('b003', '장비', '경제학과', '010-3333', '서울'))
conn.commit()

In [13]:
sql = "SELECT * FROM student"
curs.execute(sql)
rows = curs.fetchall()
print(rows) #tuple 안에 tuple 있음 > list로 변환

(('b001', '유비', '국문학과', '010-1111', '서울'), ('b002', '관우', '심리학과', '010-2222', '서울'), ('b003', '장비', '경제학과', '010-3333', '서울'), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '최민국', '컴퓨터공학과', '234-5678', None), ('S005', '이승호', '국문학과', '345-6789', None), ('S006', '정수봉', '국문학과', '456-7890', None), ('S007', '황정숙', '사학과', None, None))

In [14]:
conn.close()

In [17]:
conn = pymysql.connect(host="127.0.0.1",
                       user = "root",
                       password = "qwer1234",
                       db = "education",
                       charset = "utf8"
                       )

In [18]:
curs = conn.cursor()

In [19]:
# insert 여러줄
data = (
    ('c001', '조조', '국문학과', '016-111', '경기'),
    ('c002', '여포', '심리학과', '016-111', '경기'),
    ('c003', '손견', '교육학과', '016-111', '경기'),
)

In [20]:
sql = "insert into student(scode, sname, sdept, sphone, saddress) values (%s, %s, %s, %s, %s)"

In [21]:
curs.executemany(sql, data)
conn.commit()

In [22]:
sql = "SELECT * FROM student"
curs.execute(sql)
rows = curs.fetchall()
print(rows) #tuple 안에 tuple 있음 > list로 변환

(('b001', '유비', '국문학과', '010-1111', '서울'), ('b002', '관우', '심리학과', '010-2222', '서울'), ('b003', '장비', '경제학과', '010-3333', '서울'), ('c001', '조조', '국문학과', '016-111', '경기'), ('c002', '여포', '심리학과', '016-111', '경기'), ('c003', '손견', '교육학과', '016-111', '경기'), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '최민국', '컴퓨터공학과', '234-5678', None), ('S005', '이승호', '국문학과', '345-6789', None), ('S006', '정수봉', '국문학과', '456-7890', None), ('S007', '황정숙', '사학과', None, None))

---
#### select 내용을 dataframe으로 보기

In [23]:
# !pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-1.4.46.tar.gz (8.5 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 8.5/8.5 MB 10.8 MB/s eta 0:00:00a 0:00:01
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (setup.py) ... done
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.4.46-cp39-cp39-macosx_11_0_arm64.whl size=1561266 sha256=0ea3f1723bc1ca41d288a3c21955bac91943f759177a671d042ab3f8b1efc2a7
  Stored in directory: /Users/annakim/Library/Caches/pip/wheels/2e/7a/c5/c4adc0fde658e83ef6ece76c8a7f115fc378c85774d9e5fd42
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-1.4.46

In [24]:
import pandas as pd
from sqlalchemy import create_engine

In [25]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/education")
conn = engine.connect()

In [26]:
data = pd.read_sql_table('student', conn)
data

   scode sname   sdept    sphone saddress
0   b001    유비    국문학과  010-1111       서울
1   b002    관우    심리학과  010-2222       서울
2   b003    장비    경제학과  010-3333       서울
3   c001    조조    국문학과   016-111       경기
4   c002    여포    심리학과   016-111       경기
5   c003    손견    교육학과   016-111       경기
6   S003   이승호    국문학과  345-6789     None
7   S004   최민국  컴퓨터공학과  234-5678     None
8   S005   이승호    국문학과  345-6789     None
9   S006   정수봉    국문학과  456-7890     None
10  S007   황정숙     사학과      None     None

In [27]:
conn.close()

### dataframe을 DB로 Insert 하기

In [32]:
column = ['rank', 'title']
movies = pd.read_csv("../Data/DaumList.csv")
movies.columns = column
movies.head()

   rank              title
0     1          아바타: 물의 길
1     2         더 퍼스트 슬램덩크
2     3                 영웅
3     4  장화신은 고양이: 끝내주는 모험
4     5                스위치

In [36]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/daum")
conn = engine.connect()

In [38]:
#if_exists='append'만 사용! 이렇게 해야 데이터가 사라지지 않음
movies.to_sql(name='movie', con=engine, if_exists='append', index=False)

15

In [41]:
data = pd.read_sql_table('movie', conn)
data

    seq  rank                     title
0     1     1                 아바타: 물의 길
1     2     2                더 퍼스트 슬램덩크
2     3     3                        영웅
3     4     4         장화신은 고양이: 끝내주는 모험
4     5     5                       스위치
5     6     6  오늘 밤, 세계에서 이 사랑이 사라진다 해도
6     7     7                       올빼미
7     8     8   신비아파트 극장판 차원도깨비와 7개의 세계
8     9     9                    프린스 챠밍
9    10    10                        유령
10   11    11                3000년의 기다림
11   12    12                        문맨
12   13    13                       젠틀맨
13   14    14                시간을 꿈꾸는 소녀
14   15    15                  웃는남자 감독판

---
### TinyDB
- NoSQL 문서형 데이터베이스
- MongoDB가 대표적이지만 MongoDB는 설치가 필요하고, TinyDB는 패키지만 설치하면 됨

In [42]:
# !pip install tinydb

Collecting tinydb
  Downloading tinydb-4.7.1-py3-none-any.whl (24 kB)
Installing collected packages: tinydb
Successfully installed tinydb-4.7.1

In [43]:
# TinyDB를 사용하기 위한 라이브러리 불러오기
from tinydb import TinyDB, Query, where

In [44]:
# 데이터베이스 연결하기 - Data 폴더에 빈 json 파일이 생성된다.
filePath = "../Data/tinydb.json"
db = TinyDB(filePath)

In [45]:
# 기존 테이블이 있다면 제거하기
db.drop_table('fruits')

In [46]:
# 테이블 생성 하기
table = db.table('fruits')

In [58]:
# 테이블에 데이터 추가하기 - 한번 더 실행하면 똑같은 게 추가된다.
table.insert({'name': 'Orange', 'price': 12000})
# table.insert({'name': 'Mango', 'price': 8400})

6

In [59]:
# 모든 데이터 출력
print(table.all())

[{'name': 'Banana', 'price': 6000}, {'name': 'Banana', 'price': 6000}, {'name': 'Mango', 'price': 8400}, {'name': 'Orange', 'price': 6000}, {'name': 'Mango', 'price': 8400}, {'name': 'Orange', 'price': 12000}]

In [60]:
# Orange 검색
item = Query()
res = table.search(item.name == 'Orange')
print(res[0]['price'])

6000

In [69]:
# 가격이 8000원 이상인 과일명만 추출하기
fruitName = table.search(item.price >= 8000)

for name in fruitName:
    print("-", name['name'])

- Mango
- Mango
- Orange

In [71]:
# 수정하기
table.update({'price':84000}, item.name == "Mango")
res = table.search(item.name == "Mango")
print(res)

[{'name': 'Mango', 'price': 84000}, {'name': 'Mango', 'price': 84000}]

In [72]:
# 삭제하기
table.remove(item.name == "Mango")
print(table.all())

[{'name': 'Banana', 'price': 6000}, {'name': 'Banana', 'price': 6000}, {'name': 'Orange', 'price': 6000}, {'name': 'Orange', 'price': 12000}]

In [73]:
table.remove(where('name') == "Orange")
print(table.all())

[{'name': 'Banana', 'price': 6000}, {'name': 'Banana', 'price': 6000}]